In [89]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler
from sklearn.metrics import accuracy_score

In [90]:
# Importation des données
# Exploration des données
# Faire un Prétraitement des données
# Division des données en ensembles d'entraînement et de test
# Entraînement de différents modèles
# Évaluation des performances des modèles
# Sélection du meilleur modèle
# Optimisation du modèle sélectionné (le cas échéant)

SHOW THE HEAD OF THE DATASET

In [91]:
df = pd.read_csv('./data/titanic_data.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

LENGHT OF THE DATASET

In [92]:
len(df)

891

SHOW NaN VALUES

In [93]:
# Show all NaN values
NaN_values = df.isnull().sum()
print(NaN_values)

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

CLEAN THE DATASET

In [94]:
df['Sex'] = df['Sex'].map({'male':0, 'female':1})
df['Embarked'] = df['Embarked'].map({'S':0, 'C':1, 'Q':2})
df['Embarked'] = df['Embarked'].fillna(0)
df['Age'] = df['Age'].fillna(df['Age'].mean())

DROP COLUMNS THTA ARE NOT USEFUL

In [95]:
df = df.drop(['PassengerId', 'Name', 'Ticket', 'Cabin'], axis=1)

SHOW THE DATASET

In [96]:
df.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0         0       3    0  22.0      1      0   7.2500       0.0
1         1       1    1  38.0      1      0  71.2833       1.0
2         1       3    1  26.0      0      0   7.9250       0.0
3         1       1    1  35.0      1      0  53.1000       0.0
4         0       3    0  35.0      0      0   8.0500       0.0

CHECK NaN VALUES

In [97]:
NaN_values = df.isnull().sum()
print(NaN_values)

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64